import styles from '@/styles/Collection.module.css';
import Container from '../UI/Container.js';
import Image from "next/image";


const Collection = () => {
    const text = `В одном далёком и загадочном королевстве, где леса были полны тайн, а реки шептали древние легенды, жил мудрый змей по имени Каа. Он был не просто обычной змеёй — Каа обладал уникальной способностью видеть будущее и понимать язык природы. Его мудрость привлекала к нему всех, кто искал совета и утешения.
Однажды, в королевстве началась засуха. Река пересохла, а растения начали увядать. Люди в панике обращались к Каа за помощью. Зная, что его мудрость может спасти королевство, он решил использовать свои способности.
Каа свернулся в кольцо на вершине высокой скалы и начал медитировать. Его тело сверкало на солнце, как драгоценный камень, а вокруг него собирались люди, ожидая знаков. Вдруг из его уст раздался глубокий и мелодичный голос: «Чтобы вернуть жизнь в нашу землю, нужно объединить сердца и души всех жителей королевства».
Собравшись вместе, люди начали работать над восстановлением природы: они сажали деревья, очищали реки и делились водой с теми, кто в ней нуждался. Постепенно земля ожила — река снова наполнилась водой, а леса зазеленели.
 В благодарность за мудрость Каа жители решили создать керамический подсвечник в его честь. Подсвечник был выполнен в форме свернувшейся змеи — символа мудрости и единства. Его изящные линии и детали отражали красоту природы и силу духа.`
    
    const text2 = `Каждый вечер жители зажигали свечи в этом подсвечнике, вспоминая уроки Каа о важности единства и заботы о природе. Свет от свечей освещал их лица и напоминал о том, что даже в самые тёмные времена можно найти путь к свету.
Так подсвечник стал не только предметом интерьера, но и символом надежды и мудрости для всего королевства. И каждый раз, когда кто‑то смотрел на него или зажигал свечу, они вспоминали о великом Каа — змее с сердцем полным любви к своему народу и природе.`
    
const text3 = `Материалы и техника: Изделие изготовлено вручную из высококачественной керамики. Мастера использовали традиционные техники лепки и обжига, что обеспечивает долговечность и прочность изделия.`
    
    const text4 = `Блюдо выполнено в форме шахматной доски, но с изюминкой: его кривые линии и неожиданные изгибы создают ощущение движения и игры, словно фигуры на доске оживают и танцуют. Каждая деталь блюда проработана с любовью и фантазией. Непредсказуемые формы и контуры вызывают ассоциации с волшебным миром, где реальность переплетается с мечтой. Это блюдо станет не только функциональным предметом, но и ярким акцентом вашего интерьера.
Представьте, как ваше блюдо наполняется красивыми украшениями, либо леденцами с золотистыми фантиками и становится центром внимания. Гости будут восхищаться его оригинальностью и красотой, а вы сможете рассказать им о волшебном мире, который вдохновил вас на создание этого шедевра.` 
    const text5 = `Материалы и техника: Изделие изготовлено вручную из высококачественной керамики. Мастера использовали традиционные техники лепки и обжига, что обеспечивает долговечность и прочность изделия.`

    const text6 = `Насыщенный красный цвет символизирует любовь и тепло, а его компактные размеры позволяют легко вписать подсвечник в любое пространство — от уютного уголка на столе до стильной полки. Острые шипы придают подсвечнику характерный цыганский стиль, каждый элемент выполнен с любовью и вниманием к деталям, что делает его настоящим произведением искусства. Не упустите возможность добавить этот маленький красный керамический подсвечник с острыми шипами в свою коллекцию! Закажите сейчас и позвольте ему стать ярким акцентом вашего интерьера!`
    const text7 = `Материалы и техника: Подсвечник изготовлен вручную из высококачественной керамики. Мастера использовали традиционные техники лепки и обжига, что обеспечивает долговечность и прочность изделия. Поверхность подсвечника покрыта специальной глазурью, которая придаёт ему яркий цвет и блеск.`

    const text8 = `В далёком королевстве, где яркие цветы цвели круглый год, жил-был шут по имени Крусть. Он был не просто весёлым человеком, а настоящим мастером превращать обыденные моменты в волшебство. Его смех разносился по всему замку, а его шутки заставляли даже самых серьёзных людей улыбаться. Крусть всегда носил яркие одежды, украшенные разноцветными бубончиками, которые весело тряслись при каждом его движении. Но его настоящей гордостью была керамическая ваза, которую он сам создал. Она была выполнена в образе шута с золотыми акцентами и яркими цветами, символизирующими радость и веселье. Каждое утро Крусть ставил вазу на подоконник своего окна и наполнял её свежими цветами из своего сада. Он верил, что эти цветы не только украшают его дом, но и приносят счастье всем, кто проходит мимо. Люди останавливались, чтобы полюбоваться красотой его творения и улыбнуться. Однажды в королевство пришла беда: злая колдунья наложила заклятие на жителей, лишив их радости и смеха. Крусть не мог оставаться в стороне. Он решил использовать свою вазу как источник волшебства. Наполнив её самыми яркими цветами и произнеся заклинание смеха, он отправился на площадь. Когда Крусть поставил вазу на землю и начал рассказывать свои шутки, из неё начали вылетать искры света и радости. Люди собирались вокруг него, их сердца наполнялись смехом и счастьем. Заклятие колдуньи начало ослабевать, а вскоре полностью исчезло. С тех пор Крусть стал не только шутом королевства, но и символом надежды и волшебства. Его маленькая керамическая ваза с золотыми акцентами стала известна во всем королевстве как источник радости и красоты. И каждый раз, когда кто‑то смотрел на неё или слышал смех Крусти, они знали: волшебство всегда рядом — стоит лишь открыть сердце для радости!`
    const text9 = `Материалы и техника: Изделие изготовлено вручную из высококачественной керамики. Мастера использовали традиционные техники лепки и обжига, что обеспечивает долговечность и прочность изделия. Одной из ключевых особенностей вазы является её золочение. Золотые акценты добавляют роскоши и элегантности, подчёркивая королевскую тематику. Золото аккуратно нанесено на детали основания горлышка, создавая эффект светящегося сияния при дневном солнечном свете или на закате.`
    const text10 = `Это не просто предмет декора, это произведение искусства, которое привносит в пространство атмосферу магии и загадки. Она станет прекрасным подарком для ценителей уникального дизайна и искусства ручной работы.`
const text11 = `Это уникальное произведение искусства, выполненное в стиле сюрреализма. Он сочетает в себе элементы королевской символики и игривости, что делает его не только функциональным предметом, но и ярким акцентом в интерьере.`
const text12 = `Подсвечник имеет изысканную форму, напоминающую корону, с плавными линиями и асимметричными элементами. В верхней части расположены несколько «корон», которые служат местами для установки свечей. Каждая корона выполнена с детальной проработкой, что придаёт изделию особую выразительность. В дизайне присутствуют изогнутые линии и неожиданные формы, которые создают ощущение движения и игры. Эти элементы вызывают ассоциации с миром фантазий и снов, подчёркивая уникальность изделия.`
const text13 = `Материалы и техника: Подсвечник изготовлен вручную из высококачественной керамики. Мастера использовали традиционные техники лепки и обжига, что обеспечивает долговечность и прочность изделия. Поверхность подсвечника покрыта специальной глазурью, которая придаёт ему яркий цвет и блеск. Одной из ключевых особенностей подсвечника является его золочение. Золотые акценты добавляют роскоши и элегантности, подчёркивая королевскую тематику. Золото аккуратно нанесено на края корон и другие детали, создавая эффект светящегося сияния при зажжённых свечах.
 Это не просто предмет декора, это произведение искусства, которое привносит в пространство атмосферу магии и загадки. Он станет прекрасным подарком для ценителей уникального дизайна и искусства ручной работы.`



  return (
    <Container className="container">
        <h2 className={styles.title}>Коллекция</h2>
        <div className={styles.collection}>
            <div className={styles.collectionItem}>
                <h3 className={styles.titleProp}>Мудрый Каа</h3>
                <Image
                    src="/snakeFirst.png"
                    alt="Описание изображения"
                    layout="intrinsic"
                    objectFit="cover"
                    width={890} 
                    height={1080}
                    quality={100} 
                    />
                <Image
                    src="/snakeTwo.png"
                    alt="Описание изображения"
                    layout="intrinsic"
                    objectFit="cover"
                    width={890} 
                    height={1080}
                    quality={100} 
                    />
                <Image
                    src="/snakeSecond.png"
                    alt="Описание изображения"
                    layout="intrinsic"
                    objectFit="cover"
                    width={890} 
                    height={1080}
                    quality={100} 
                    />
                <div className={styles.textBlock}>
                    <p>{text}</p>
                    <p>{text2}</p>
                    <p>{text3}</p>
                    <p className={styles.price}>Цена: 7 000 ₽</p>
                </div>
            </div>
            <div className={styles.collectionItem}>
                <h3 className={styles.titleProp}>Шахматная доска</h3>
                <Image
                    src="/chessFirst.png"
                    alt="Описание изображения"
                    layout="intrinsic"
                    objectFit="cover"
                    width={890} 
                    height={550}
                    quality={100} 
                    />
                <Image
                    src="/chessTwo.png"
                    alt="Описание изображения"
                    layout="intrinsic"
                    objectFit="cover"
                    width={890} 
                    height={550}
                    quality={100} 
                    />
                <Image
                    src="/chessSecond.png"
                    alt="Описание изображения"
                    layout="intrinsic"
                    objectFit="cover"
                    width={890} 
                    height={550}
                    quality={100} 
                    />
                <div className={styles.textBlock}>
                    <p>{text4}</p>
                    <p>{text5}</p>
                    <p className={styles.price}>Цена: 11 000 ₽</p>
                </div>
            </div>
            <div className={styles.collectionItem}>
                <h3 className={styles.titleProp}>Уязвимость дебюта</h3>
                <Image
                    src="/debutFirst.png"
                    alt="Описание изображения"
                    layout="intrinsic"
                    objectFit="cover"
                    width={890} 
                    height={1080}
                    quality={100} 
                    />
                <Image
                    src="/debutTwo.png"
                    alt="Описание изображения"
                    layout="intrinsic"
                    objectFit="cover"
                    width={890} 
                    height={500}
                    quality={100} 
                    />
                <Image
                    src="/debutSecond.png"
                    alt="Описание изображения"
                    layout="intrinsic"
                    objectFit="cover"
                    width={890} 
                    height={500}
                    quality={100} 
                    />
                <div className={styles.textBlock}>
                    <p>{text6}</p>
                    <p>{text7}</p>
                    <p className={styles.price}>Цена: 4 000 ₽</p>
                </div>
            </div>
            <div className={styles.collectionItem}>
                <h3 className={styles.titleProp}>Богема 	цирка, Шут или Арлекин?</h3>
                <Image
                    src="/clown.png"
                    alt="Описание изображения"
                    layout="intrinsic"
                    objectFit="cover"
                    width={890} 
                    height={1080}
                    quality={100} 
                    />
                <div className={styles.textBlock}>
                    <p>{text8}</p>
                    <p>{text9}</p>
                    <p>{text10}</p>
                    <p className={styles.price}>Цена: 19 000 ₽</p>
                </div>
            </div>
            <div className={styles.collectionItem}>
                <h3 className={styles.titleProp}>«Морское величество»</h3>
                <Image
                    src="/uniqFirst.png"
                    alt="Описание изображения"
                    layout="intrinsic"
                    objectFit="cover"
                    width={890} 
                    height={1080}
                    quality={100} 
                    />
                <Image
                    src="/uniqSecond.png"
                    alt="Описание изображения"
                    layout="intrinsic"
                    objectFit="cover"
                    width={890} 
                    height={1080}
                    quality={100} 
                    />
                <div className={styles.textBlock}>
                    <p>{text11}</p>
                    <p>{text12}</p>
                    <p>{text13}</p>
                </div>
            </div>
        </div>
    </Container>
  );
};

export default Collection;
